Tekla Open API Reference for Tekla Structures 2025
DrawingCreator Class
 The DrawingCreator class is for handling the creation of drawings using the built-in logic of Tekla Structures.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.Automation.DrawingCreator
 Namespace: Tekla.Structures.Drawing.Automation
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class DrawingCreator
<SerializableAttribute>
Public NotInheritable Class DrawingCreator
Methods
Name | Description
CreateDrawings(AutoDrawingRule, Identifier)
 Creates drawings using the AutoDrawing tool of Tekla Structures.
CreateDrawings(AutoDrawingRule, List<Identifier>, AutoDrawingsStatusEnum)
 Creates drawings using the AutoDrawing tool of Tekla Structures.
CreateDrawings(AutoDrawingRule, Identifier, AutoDrawingsStatusEnum)
 Creates drawings using the AutoDrawing tool of Tekla Structures.
Top
See Also
Reference
Tekla.Structures.Drawing.Automation Namespace